{
    "ankur_pose_data": {
        "citation": "3D Human Pose from Silhouettes by Relevance Vector Regression (In CVPR'04). A. Agarwal and B. Triggs.",
        "details": "Artificially generated data of silhouettes given poses. Note that the data does not display a left/right ambiguity because across the entire data set one of the arms sticks out more the the other, disambiguating the pose as to which way the individual is facing.",
        "files": [
            [
                "ankurDataPoseSilhouette.mat"
            ]
        ],
        "license": null,
        "size": 1,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/ankur_pose_data/"
        ]
    },
    "boston_housing": {
        "citation": "Harrison, D. and Rubinfeld, D.L. 'Hedonic prices and the demand for clean air', J. Environ. Economics & Management, vol.5, 81-102, 1978.",
        "details": "The Boston Housing data relates house values in Boston to a range of input variables.",
        "files": [
            [
                "Index",
                "housing.data",
                "housing.names"
            ]
        ],
        "license": null,
        "size": 51276,
        "urls": [
            "http://archive.ics.uci.edu/ml/machine-learning-databases/housing/"
        ]
    },
    "boxjenkins_airline": {
        "citation": "Box & Jenkins (1976), in file: data/airpass, Description: International airline passengers: monthly totals in thousands. Jan 49 \\u2013 Dec 60",
        "details": "International airline passengers, monthly totals from January 1949 to December 1960.",
        "files": [
            [
                "boxjenkins_airline.csv"
            ]
        ],
        "license": "You may copy and redistribute the data. You may make derivative works from the data. You may use the data for commercial purposes. You may not sublicence the data when redistributing it. You may not redistribute the data under a different license. Source attribution on any use of this data: Must refer source.",
        "size": 46779,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/boxjenkins_airline/"
        ]
    },
    "brendan_faces": {
        "citation": "Frey, B. J., Colmenarez, A and Huang, T. S. Mixtures of Local Linear Subspaces for Face Recognition. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition 1998, 32-37, June 1998. Computer Society Press, Los Alamitos, CA.",
        "details": "A video of Brendan Frey's face popularized as a benchmark for visualization by the Locally Linear Embedding.",
        "files": [
            [
                "frey_rawface.mat"
            ]
        ],
        "license": null,
        "size": 1100584,
        "urls": [
            "http://www.cs.nyu.edu/~roweis/data/"
        ]
    },
    "cifar-10": {
        "citation": "Learning Multiple Layers of Features from Tiny Images, Alex Krizhevsky, 2009, Tech report available here: http://www.cs.toronto.edu/~kriz/learning-features-2009-TR.pdf",
        "details": "The CIFAR-10 and CIFAR-100 are labeled subsets of the 80 million tiny images dataset. They were collected by Alex Krizhevsky, Vinod Nair, and Geoffrey Hinton. Details are available on this webpage: http://www.cs.toronto.edu/~kriz/cifar.html. The CIFAR-10 dataset consists of 60000 32x32 colour images in 10 classes, with 6000 images per class. There are 50000 training images and 10000 test images.",
        "files": [
            [
                "cifar-10-python.tar.gz"
            ]
        ],
        "license": null,
        "size": 0,
        "urls": [
            "http://www.cs.toronto.edu/~kriz/"
        ]
    },
    "cmu_mocap_full": {
        "citation": "Please include this in your acknowledgements: The data used in this project was obtained from mocap.cs.cmu.edu.\\nThe database was created with funding from NSF EIA-0196217.",
        "details": "CMU Motion Capture data base. Captured by a Vicon motion capture system consisting of 12 infrared MX-40 cameras, each of which is capable of recording at 120 Hz with images of 4 megapixel resolution. Motions are captured in a working volume of approximately 3m x 8m. The capture subject wears 41 markers and a stylish black garment.",
        "files": [
            [
                "allasfamc.zip"
            ]
        ],
        "license": "From http://mocap.cs.cmu.edu. This data is free for use in research projects. You may include this data in commercially-sold products, but you may not resell this data directly, even in converted form. If you publish results obtained using this data, we would appreciate it if you would send the citation to your published paper to jkh+mocap@cs.cmu.edu, and also would add this text to your acknowledgments section: The data used in this project was obtained from mocap.cs.cmu.edu. The database was created with funding from NSF EIA-0196217.",
        "size": null,
        "urls": [
            "http://mocap.cs.cmu.edu/subjects"
        ]
    },
    "creep_rupture": {
        "citation": "Materials Algorithms Project Data Library: MAP_DATA_CREEP_RUPTURE. F. Brun and T. Yoshida.",
        "details": "Provides 2066 creep rupture test results of steels (mainly of two kinds of steels: 2.25Cr and 9-12 wt% Cr ferritic steels). See http://www.msm.cam.ac.uk/map/data/materials/creeprupt-b.html.",
        "files": [
            [
                "creeprupt.tar"
            ]
        ],
        "license": null,
        "size": 602797,
        "urls": [
            "http://www.msm.cam.ac.uk/map/data/tar/"
        ]
    },
    "decampos_characters": {
        "citation": "T. de Campos, B. R. Babu, and M. Varma. Character recognition in natural images. VISAPP 2009.",
        "details": "Examples of hand written digits taken from the de Campos et al paper on Character Recognition in Natural Images.",
        "files": [
            [
                "characters.npy",
                "digits.npy"
            ]
        ],
        "license": null,
        "size": 2031872,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/decampos_digits/"
        ]
    },
    "della_gatta": {
        "citation": "Direct targets of the TRP63 transcription factor revealed by a combination of gene expression profiling and reverse engineering. Giusy Della Gatta, Mukesh Bansal, Alberto Ambesi-Impiombato, Dario Antonini, Caterina Missero, and Diego di Bernardo, Genome Research 2008",
        "details": "The full gene expression data set from della Gatta et al (http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2413161/) processed by RMA.",
        "files": [
            [
                "DellaGattadata.mat"
            ]
        ],
        "license": null,
        "size": 3729650,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/della_gatta/"
        ]
    },
    "drosophila_protein": {
        "citation": "Becker K, Balsa-Canto E, Cicin-Sain D, Hoermann A, Janssens H, et al. (2013) Reverse-Engineering Post-Transcriptional Regulation of Gap Genes in Drosophila melanogaster. PLoS Comput Biol 9(10): e1003281. doi:10.1371/journal.pcbi.1003281",
        "details": "Expression of the gap genes Krüppel, knirps, and giant in Drosophila melanogaster. Data includes quantitative datasets of gap gene mRNA and protein expression to solve and fit a model of post-transcriptional regulation, and establish its structural and practical identifiability",
        "files": [
            [
                "becker_et_al.csv"
            ]
        ],
        "license": null,
        "size": 20258,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/drosophila_protein/"
        ]
    },
    "spellman_yeast": {
        "citation": "Paul T. Spellman, Gavin Sherlock, Michael Q. Zhang, Vishwanath R. Iyer, Kirk Anders, Michael B. Eisen, Patrick O. Brown, David Botstein, and Bruce Futcher 'Comprehensive Identification of Cell Cycle-regulated Genes of the Yeast Saccharomyces cerevisiae by Microarray Hybridization.'  Molecular Biology of the Cell 9, 3273-3297",
        "details": "Two colour spotted cDNA array data set of a series of experiments to identify which genes in Yeast are cell cycle regulated.",
        "files": [
            [
                "combined.txt"
            ]
        ],
        "license": null,
        "size": 2510955,
        "urls": [
            "http://genome-www.stanford.edu/cellcycle/data/rawdata/"
        ]
    },
    "lee_yeast_ChIP": {
        "citation": "Tong Ihn Lee, Nicola J. Rinaldi, Francois Robert, Duncan T. Odom, Ziv Bar-Joseph, Georg K. Gerber, Nancy M. Hannett, Christopher T. Harbison, Craig M. Thompson, Itamar Simon, Julia Zeitlinger, Ezra G. Jennings, Heather L. Murray, D. Benjamin Gordon, Bing Ren, John J. Wyrick, Jean-Bosco Tagne, Thomas L. Volkert, Ernest Fraenkel, David K. Gifford, Richard A. Young 'Transcriptional Regulatory Networks in Saccharomyces cerevisiae' Science 298 (5594) pg 799--804. DOI: 10.1126/science.1075090",
        "details": "Binding location analysis for 106 regulators in yeast. The data consists of p-values for binding of regulators to genes derived from ChIP-chip experiments.",
        "files": [
            [
                "binding_by_gene.tsv"
            ]
        ],
        "license": null,
        "size": 1674161,
        "urls": [
            "http://jura.wi.mit.edu/young_public/regulatory_network/"
        ]
    },
    "epomeo_gpx": {
        "citation": "",
        "details": "Five different GPS traces of the same run up Mount Epomeo in Ischia. The traces are from different sources. endomondo_1 and endomondo_2 are traces from the mobile phone app Endomondo, with a split in the middle. garmin_watch_via_endomondo is the trace from a Garmin watch, with a segment missing about 4 kilometers in. viewranger_phone and viewranger_tablet are traces from a phone and a tablet through the viewranger app. The viewranger_phone data comes from the same mobile phone as the Endomondo data (i.e. there are 3 GPS devices, but one device recorded two traces).",
        "files": [
            [
                "endomondo_1.gpx",
                "endomondo_2.gpx",
                "garmin_watch_via_endomondo.gpx",
                "viewranger_phone.gpx",
                "viewranger_tablet.gpx"
            ]
        ],
        "license": null,
        "size": 2031872,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/epomeo_gpx/"
        ]
    },
    "football_data": {
        "citation": "",
        "details": "Results of English football matches since 1993/94 season.",
        "files": [
            [
                "E0.csv",
                "E1.csv",
                "E2.csv",
                "E3.csv"
            ]
        ],
        "license": null,
        "size": 1,
        "urls": [
            "http://www.football-data.co.uk/mmz4281/"
        ]
    },
    "fruitfly_tomancak": {
        "citation": "",
        "details": "",
        "files": [
            [
                "tomancak_exprs.csv",
                "tomancak_se.csv",
                "tomancak_prctile5.csv",
                "tomancak_prctile25.csv",
                "tomancak_prctile50.csv",
                "tomancak_prctile75.csv",
                "tomancak_prctile95.csv"
            ]
        ],
        "license": null,
        "size": 59000000,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/fruitfly_tomancak/"
        ]
    },
    "fruitfly_tomancak_cel_files": {
        "citation": "'Systematic determination of patterns of gene expression during Drosophila embryogenesis' Pavel Tomancak, Amy Beaton, Richard Weiszmann, Elaine Kwan, ShengQiang Shu, Suzanna E Lewis, Stephen Richards, Michael Ashburner, Volker Hartenstein, Susan E Celniker, and Gerald M Rubin",
        "details": "Gene expression results from blastoderm development in Drosophila Melanogaster.",
        "files": [
            [
                "embryo_tc_4_1.CEL",
                "embryo_tc_4_2.CEL",
                "embryo_tc_4_3.CEL",
                "embryo_tc_4_4.CEL",
                "embryo_tc_4_5.CEL",
                "embryo_tc_4_6.CEL",
                "embryo_tc_4_7.CEL",
                "embryo_tc_4_8.CEL",
                "embryo_tc_4_9.CEL",
                "embryo_tc_4_10.CEL",
                "embryo_tc_4_11.CEL",
                "embryo_tc_4_12.CEL",
                "embryo_tc_6_1.CEL",
                "embryo_tc_6_2.CEL",
                "embryo_tc_6_3.CEL",
                "embryo_tc_6_4.CEL",
                "embryo_tc_6_5.CEL",
                "embryo_tc_6_6.CEL",
                "embryo_tc_6_7.CEL",
                "embryo_tc_6_8.CEL",
                "embryo_tc_6_9.CEL",
                "embryo_tc_6_10.CEL",
                "embryo_tc_6_11.CEL",
                "embryo_tc_6_12.CEL",
                "embryo_tc_8_1.CEL",
                "embryo_tc_8_2.CEL",
                "embryo_tc_8_3.CEL",
                "embryo_tc_8_4.CEL",
                "embryo_tc_8_5.CEL",
                "embryo_tc_8_6.CEL",
                "embryo_tc_8_7.CEL",
                "embryo_tc_8_8.CEL",
                "embryo_tc_8_9.CEL",
                "embryo_tc_8_10.CEL",
                "embryo_tc_8_11.CEL",
                "embryo_tc_8_12.CEL",
                "CG_AffyOligo_Gadfly3_01_13_03",
                "embryo_tc_rma_release2.txt",
                "embryo_tc_rma_release3.txt",
                "na_affy_oligo.dros",
                "README.TXT"
            ]
        ],
        "license": null,
        "size": 389000000,
        "urls": [
            "ftp://ftp.fruitfly.org/pub/embryo_tc_array_data/"
        ]
    },
    "google_trends": {
        "citation": "",
        "details": "Google trends results.",
        "files": [
            [

            ]
        ],
        "license": null,
        "size": 0,
        "urls": [
            "http://www.google.com/trends/"
        ]
    },

    "hapmap3": {
        "citation": "Gibbs, Richard A., et al. 'The international HapMap project.' Nature 426.6968 (2003): 789-796.",
        "details": "HapMap Project: Single Nucleotide Polymorphism sequenced in all human populations. \n        The HapMap phase three SNP dataset - 1184 samples out of 11 populations.\n        See http://www.nature.com/nature/journal/v426/n6968/abs/nature02168.html for details.\n\n        SNP_matrix (A) encoding [see Paschou et all. 2007 (PCA-Correlated SNPs...)]:\n        Let (B1,B2) be the alphabetically sorted bases, which occur in the j-th SNP, then\n\n              /  1, iff SNPij==(B1,B1)\n        Aij = |  0, iff SNPij==(B1,B2)\n              \\\\ -1, iff SNPij==(B2,B2)\n\n        The SNP data and the meta information (such as iid, sex and phenotype) are\n        stored in the dataframe datadf, index is the Individual ID, \n        with following columns for metainfo:\n\n            * family_id   -> Family ID\n            * paternal_id -> Paternal ID\n            * maternal_id -> Maternal ID\n            * sex         -> Sex (1=male; 2=female; other=unknown)\n            * phenotype   -> Phenotype (-9, or 0 for unknown)\n            * population  -> Population string (e.g. 'ASW' - 'YRI')\n            * rest are SNP rs (ids)\n\n        More information is given in infodf:\n\n            * Chromosome:\n                - autosomal chromosemes                -> 1-22\n                - X    X chromosome                    -> 23\n                - Y    Y chromosome                    -> 24\n                - XY   Pseudo-autosomal region of X    -> 25\n                - MT   Mitochondrial                   -> 26\n            * Relative Positon (to Chromosome) [base pairs]\n\n        ",
        "files": [
            [
                "hapmap3_r2_b36_fwd.consensus.qc.poly.map.bz2",
                "hapmap3_r2_b36_fwd.consensus.qc.poly.ped.bz2",
                "relationships_w_pops_121708.txt"
            ]
        ],
        "license": "International HapMap Project Public Access License (http://hapmap.ncbi.nlm.nih.gov/cgi-perl/registration#licence)",
        "size": 3458246739,
        "urls": [
            "http://hapmap.ncbi.nlm.nih.gov/downloads/genotypes/latest_phaseIII_ncbi_b36/plink_format/"
        ]
    },
    "isomap_face_data": {
        "citation": "A Global Geometric Framework for Nonlinear Dimensionality Reduction, J. B. Tenenbaum, V. de Silva and J. C. Langford, Science 290 (5500): 2319-2323, 22 December 2000",
        "details": "Face data made available by Tenenbaum, de Silva and Langford to demonstrate isomap, available from http://isomap.stanford.edu/datasets.html.",
        "files": [
            [
                "face_data.mat"
            ]
        ],
        "license": null,
        "size": 24229368,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/isomap_face_data/"
        ]
    },
    "mauna_loa": {
        "citation": "Mauna Loa Data. Dr. Pieter Tans, NOAA/ESRL (www.esrl.noaa.gov/gmd/ccgg/trends/) and Dr. Ralph Keeling, Scripps Institution of Oceanography (scrippsco2.ucsd.edu/).",
        "details": "The 'average' column contains the monthly mean CO2 mole fraction determined from daily averages.  The mole fraction of CO2, expressed as parts per million (ppm) is the number of molecules of CO2 in every one million molecules of dried air (water vapor removed).  If there are missing days concentrated either early or late in the month, the monthly mean is corrected to the middle of the month using the average seasonal cycle.  Missing months are denoted by -99.99. The 'interpolated' column includes average values from the preceding column and interpolated values where data are missing.  Interpolated values are computed in two steps.  First, we compute for each month the average seasonal cycle in a 7-year window around each monthly value.  In this way the seasonal cycle is allowed to change slowly over time.  We then determine the 'trend' value for each month by removing the seasonal cycle; this result is shown in the 'trend' column.  Trend values are linearly interpolated for missing months. The interpolated monthly mean is then the sum of the average seasonal cycle value and the trend value for the missing month.\n\nNOTE: In general, the data presented for the last year are subject to change, depending on recalibration of the reference gas mixtures used, and other quality control procedures. Occasionally, earlier years may also be changed for the same reasons.  Usually these changes are minor.\n\nCO2 expressed as a mole fraction in dry air, micromol/mol, abbreviated as ppm \n\n (-99.99 missing data;  -1 no data for daily means in month)",
        "files": [
            [
                "co2_mm_mlo.txt"
            ]
        ],
        "license": "-------------------------------------------------------------------- USE OF NOAA ESRL DATA\n\n  These data are made freely available to the public and the scientific community in the belief that their wide dissemination will lead to greater understanding and new scientific insights. The availability of these data does not constitute publication of the data.  NOAA relies on the ethics and integrity of the user to insure that ESRL receives fair credit for their work.  If the data  are obtained for potential use in a publication or presentation,  ESRL should be informed at the outset of the nature of this work.   If the ESRL data are essential to the work, or if an important  result or conclusion depends on the ESRL data, co-authorship may be appropriate.  This should be discussed at an early stage in the work.  Manuscripts using the ESRL data should be sent to ESRL for review before they are submitted for publication so we can insure that the quality and limitations of the data are accurately represented.\n\n  Contact:   Pieter Tans (303 497 6678; pieter.tans@noaa.gov)\n\n  RECIPROCITY  Use of these data implies an agreement to reciprocate. Laboratories making similar measurements agree to make their own data available to the general public and to the scientific community in an equally complete and easily accessible form. Modelers are encouraged to make available to the community, upon request, their own tools used in the interpretation of the ESRL data, namely well documented model code, transport fields, and additional information necessary for other scientists to repeat the work and to run modified versions. Model availability includes collaborative support for new users of the models.\n --------------------------------------------------------------------\n\n     See www.esrl.noaa.gov/gmd/ccgg/trends/ for additional details.",
        "size": 46779,
        "urls": [
            "ftp://aftp.cmdl.noaa.gov/products/trends/co2/"
        ]
    },
    "olivetti_faces": {
        "citation": "Ferdinando Samaria and Andy Harter, Parameterisation of a Stochastic Model for Human Face Identification. Proceedings of 2nd IEEE Workshop on Applications of Computer Vision, Sarasota FL, December 1994",
        "details": "Olivetti Research Labs Face data base, acquired between December 1992 and December 1994 in the Olivetti Research Lab, Cambridge (which later became AT&T Laboratories, Cambridge). When using these images please give credit to AT&T Laboratories, Cambridge. ",
        "files": [
            [
                "att_faces.zip"
            ],
            [
                "olivettifaces.mat"
            ]
        ],
        "license": null,
        "size": 8561331,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/olivetti_faces/",
            "http://www.cs.nyu.edu/~roweis/data/"
        ]
    },
    "olivetti_glasses": {
        "citation": "Information recorded in olivetti_faces entry. Should be used from there.",
        "details": "Information recorded in olivetti_faces entry. Should be used from there.",
        "files": [
            [
                "has_glasses.np"
            ],
            [
                "olivettifaces.mat"
            ]
        ],
        "license": null,
        "size": 4261047,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/olivetti_faces/",
            "http://www.cs.nyu.edu/~roweis/data/"
        ]
    },
    "olympic_marathon_men": {
        "citation": null,
        "details": "Olympic mens' marathon gold medal winning times from 1896 to 2012. Time given in pace (minutes per kilometer). Data is originally downloaded and collated from Wikipedia, we are not responsible for errors in the data",
        "files": [
            [
                "olympicMarathonTimes.csv"
            ]
        ],
        "license": null,
        "size": 584,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/olympic_marathon_men/"
        ]
    },
    "osu_accad": {
        "citation": "The Open Motion Data Project by The Ohio State University Advanced Computing Center for the Arts and Design, http://accad.osu.edu/research/mocap/mocap_data.htm.",
        "details": "Motion capture data of different motions from the Open Motion Data Project at Ohio State University.",
        "files": [
            [
                "swagger1TXT.ZIP",
                "handspring1TXT.ZIP",
                "quickwalkTXT.ZIP",
                "run1TXT.ZIP",
                "sprintTXT.ZIP",
                "dogwalkTXT.ZIP",
                "camper_04TXT.ZIP",
                "dance_KB3_TXT.ZIP",
                "per20_TXT.ZIP",
                "perTWO07_TXT.ZIP",
                "perTWO13_TXT.ZIP",
                "perTWO14_TXT.ZIP",
                "perTWO15_TXT.ZIP",
                "perTWO16_TXT.ZIP"
            ],
            [
                "connections.txt"
            ]
        ],
        "license": "Data is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License (http://creativecommons.org/licenses/by-nc-sa/3.0/).",
        "size": 15922790,
        "urls": [
            "http://accad.osu.edu/research/mocap/data/",
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/stick/"
        ]
    },
    "osu_run1": {
        "citation": "The Open Motion Data Project by The Ohio State University Advanced Computing Center for the Arts and Design, http://accad.osu.edu/research/mocap/mocap_data.htm.",
        "details": "Motion capture data of a stick man running from the Open Motion Data Project at Ohio State University.",
        "files": [
            [
                "run1TXT.ZIP"
            ],
            [
                "connections.txt"
            ]
        ],
        "license": "Data is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License (http://creativecommons.org/licenses/by-nc-sa/3.0/).",
        "size": 338103,
        "urls": [
            "http://accad.osu.edu/research/mocap/data/",
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/stick/"
        ]
    },
    "pumadyn-32nm": {
        "citation": "Created by Zoubin Ghahramani using the Matlab Robotics Toolbox of Peter Corke. Corke, P. I. (1996). A Robotics Toolbox for MATLAB. IEEE Robotics and Automation Magazine, 3 (1): 24-32.",
        "details": "Pumadyn non linear 32 input data set with moderate noise. See http://www.cs.utoronto.ca/~delve/data/pumadyn/desc.html for details.",
        "files": [
            [
                "pumadyn-32nm.tar.gz"
            ]
        ],
        "license": "Data is made available by the Delve system at the University of Toronto",
        "size": 5861646,
        "urls": [
            "ftp://ftp.cs.toronto.edu/pub/neuron/delve/data/tarfiles/pumadyn-family/"
        ]
    },
    "ripley_prnn_data": {
        "citation": "Pattern Recognition and Neural Networks by B.D. Ripley (1996) Cambridge University Press ISBN 0 521 46986 7",
        "details": "Data sets from Brian Ripley's Pattern Recognition and Neural Networks",
        "files": [
            [
                "Cushings.dat",
                "README",
                "crabs.dat",
                "fglass.dat",
                "fglass.grp",
                "pima.te",
                "pima.tr",
                "pima.tr2",
                "synth.te",
                "synth.tr",
                "viruses.dat",
                "virus3.dat"
            ]
        ],
        "license": null,
        "size": 93565,
        "urls": [
            "http://www.stats.ox.ac.uk/pub/PRNN/"
        ]
    },
    "robot_wireless": {
        "citation": "WiFi-SLAM using Gaussian Process Latent Variable Models by Brian Ferris, Dieter Fox and Neil Lawrence in IJCAI'07 Proceedings pages 2480-2485. Data used in A Unifying Probabilistic Perspective for Spectral Dimensionality Reduction: Insights and New Models by Neil D. Lawrence, JMLR 13 pg 1609--1638, 2012.",
        "details": "Data created by Brian Ferris and Dieter Fox. Consists of WiFi access point strengths taken during a circuit of the Paul Allen building at the University of Washington.",
        "files": [
            [
                "uw-floor.txt"
            ]
        ],
        "license": null,
        "size": 284390,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/robot_wireless/"
        ]
    },
    "rogers_girolami_data": {
        "citation": "A First Course in Machine Learning. Simon Rogers and Mark Girolami: Chapman & Hall/CRC, ISBN-13: 978-1439824146",
        "details": "Data from the textbook 'A First Course in Machine Learning'. Available from http://www.dcs.gla.ac.uk/~srogers/firstcourseml/.",
        "files": [
            [
                "firstcoursemldata.tar.gz"
            ]
        ],
        "license": null,
        "size": 21949154,
        "suffices": [
            [
                "?dl=1"
            ]
        ],
        "urls": [
            "https://www.dropbox.com/sh/7p6tu1t29idgliq/_XqlH_3nt9/"
        ]
    },
    "singlecell": {
        "citation": "Guoji Guo, Mikael Huss, Guo Qing Tong, Chaoyang Wang, Li Li Sun, Neil D. Clarke, Paul Robson, Resolution of Cell Fate Decisions Revealed by Single-Cell Gene Expression Analysis from Zygote to Blastocyst, Developmental Cell, Volume 18, Issue 4, 20 April 2010, Pages 675-685, ISSN 1534-5807, http://dx.doi.org/10.1016/j.devcel.2010.02.012. (http://www.sciencedirect.com/science/article/pii/S1534580710001103) Keywords: DEVBIO",
        "details": "qPCR TaqMan array single cell experiment in mouse. The data is taken from the early stages of development when the Blastocyst is forming. At the 32 cell stage the data is already separated into the trophectoderm (TE) which goes onto form the placenta and the inner cellular mass (ICM). The ICM further differentiates into the epiblast (EPI)---which gives rise to the endoderm, mesoderm and ectoderm---and the primitive endoderm (PE) which develops into the amniotic sack. Guo et al selected 48 genes for expression measurement. They labelled the resulting cells and their labels are included as an aide to visualization.",
        "files": [
            [
                "singlecell.csv"
            ]
        ],
        "license": "ScienceDirect: http://www.elsevier.com/locate/termsandconditions?utm_source=sciencedirect&utm_medium=link&utm_campaign=terms",
        "size": 233.1,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/singlecell/"
        ]
    },
    "singlecell_islam": {
        "citation": "Single-Cell RNA-Seq Reveals Dynamic, Random Monoallelic Gene Expression in Mammalian Cells Qiaolin Deng, Daniel Ramskoeld, Bjoern Reinius, and Rickard Sandberg Science 10 January 2014: 343 (6167), 193-196. [DOI:10.1126/science.1245316]",
        "details" : "92 single cells (48 mouse ES cells, 44 mouse embryonic fibroblasts and 4 negative controls) were analyzed by single-cell tagged reverse transcription (STRT)",
        "files"   : [["GSE29087_L139_expression_tab.txt.gz"], ["GSE29087_family.soft.gz"]],
        "license" : "Gene Expression Omnibus: http://www.ncbi.nlm.nih.gov/geo/info/disclaimer.html",
        "size"    : 1159449,
        "urls"    : ["ftp://ftp.ncbi.nlm.nih.gov/geo/series/GSE29nnn/GSE29087/suppl/", "ftp://ftp.ncbi.nlm.nih.gov/geo/series/GSE29nnn/GSE29087/soft/"]
    },
    "singlecell_deng": {
        "citation": "Deng Q, Ramsköld D, Reinius B, Sandberg R. Single-cell RNA-seq reveals dynamic, random monoallelic gene expression in mammalian cells. Science 2014 Jan 10;343(6167):193-6. PMID: 24408435",
        "details" : "First generation mouse strain crosses were used to study monoallelic expression on the single cell level",
        "files"   : [["?acc=GSE45719&format=file"], ["GSE45719_series_matrix.txt.gz"]],
        "license" : "Gene Expression Omnibus: http://www.ncbi.nlm.nih.gov/geo/info/disclaimer.html",
        "size"    : 1159449,
        "save_names": [["GSE45719_Raw.tar"], [null]],
        "urls"    : ["http://www.ncbi.nlm.nih.gov/geo/download/", "ftp://ftp.ncbi.nlm.nih.gov/geo/series/GSE45nnn/GSE45719/matrix/"]
    },
    "sod1_mouse": {
        "citation": "Transcriptomic indices of fast and slow disease progression in two mouse models of amyotrophic lateral sclerosis' Nardo G1, Iennaco R, Fusi N, Heath PR, Marino M, Trolese MC, Ferraiuolo L, Lawrence N, Shaw PJ, Bendotti C Brain. 2013 Nov;136(Pt 11):3305-32. doi: 10.1093/brain/awt250. Epub 2013 Sep 24.",
        "details": "Gene expression data from two separate strains of mice: C57 and 129Sv in wild type and SOD1 mutant strains.",
        "files": [
            [
                "sod1_C57_129_exprs.csv",
                "sod1_C57_129_se.csv"
            ]
        ],
        "license": null,
        "size": 0,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/sod1_mouse/"
        ]
    },
    "swiss_roll": {
        "citation": "A Global Geometric Framework for Nonlinear Dimensionality Reduction, J. B. Tenenbaum, V. de Silva and J. C. Langford, Science 290 (5500): 2319-2323, 22 December 2000",
        "details": "Swiss roll data made available by Tenenbaum, de Silva and Langford to demonstrate isomap, available from http://isomap.stanford.edu/datasets.html.",
        "files": [
            [
                "swiss_roll_data.mat"
            ]
        ],
        "license": null,
        "size": 800256,
        "urls": [
            "http://isomap.stanford.edu/"
        ]
    },
    "three_phase_oil_flow": {
        "citation": "Bishop, C. M. and G. D. James (1993). Analysis of multiphase flows using dual-energy gamma densitometry and neural networks. Nuclear Instruments and Methods in Physics Research A327, 580-593",
        "details": "The three phase oil data used initially for demonstrating the Generative Topographic mapping.",
        "files": [
            [
                "DataTrnLbls.txt",
                "DataTrn.txt",
                "DataTst.txt",
                "DataTstLbls.txt",
                "DataVdn.txt",
                "DataVdnLbls.txt"
            ]
        ],
        "license": null,
        "size": 712796,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/three_phase_oil_flow/"
        ]
    },
    "xw_pen": {
        "citation": "Michael E. Tipping and Neil D. Lawrence. Variational inference for Student-t models: Robust Bayesian interpolation and generalised component analysis. Neurocomputing, 69:123--141, 2005",
        "details": "Accelerometer pen data used for robust regression by Tipping and Lawrence.",
        "files": [
            [
                "xw_pen_15.csv"
            ]
        ],
        "license": null,
        "size": 3410,
        "urls": [
            "http://staffwww.dcs.shef.ac.uk/people/N.Lawrence/dataset_mirror/xw_pen/"
        ]
    }
}
